export const DUMMY_LESSON = {
  id: 'n1',
  activity_plan: {
    title: '거미는 왜 줄을 타고 올라갔을까?',
    subject: '봄 곤충과 동물',
    detail_subject: '거미',
    activity_type: ['동극'],
    acitivty_goal: [
      '동화의 내용을 동극으로 표현해본다',
      '거미에 관심을 가진다.',
    ],
    activity_tool: ['거미가 줄을 타고 올라갑니다 책', '털실', '머리띠'],
    nuri_curriculum: [
      {
        의사소통: {
          '책과 이야기 즐기기': '책에 관심을 가지고 상상하기를 즐긴다.',
        },
      },
      {
        자연탐구: {
          '자연과 더불어 살기': '주변의 동식물에 관심을 가진다.',
        },
        사회관계: {
          '더불어 생활하기': '친구와 서로 도우며 사이좋게 지낸다.',
        },
      },
    ],
    file: [
      {
        url: '/images/spider.jpg',
        type: 'jpg',
      },
    ],
    activity_content: [
      {
        subtitle: '거미와 대화를 하며 동기를 유발한다.',
        content: `-사랑하는 달님반! 우리가 방금 무슨 노래를 불렀지?\n-우리 달님반의 노래를 듣고 진짜 거미가 우리 반에 찾아왔대. 우리 그럼 다함께 거미를 불러볼까? 거미야~\n(거미) 달님반 친구들 안녕, 나는 달님반 친구들이 노래로 나를 불러줘서 이렇게 찾아왔어. 난 오늘 내 제일 친한 친구들인 강아지, 고양이, 사자를 불러서 파티를 할거야. 너희들은 파티를 좋아하니?\n-(거미) 그럼 우리 파티에서 무슨 일이 있었는지 내 이야기를 들어볼래?\n그럼 지금부터 선생님이 거미의 이야기를 들려줄게. 거미야 우리 반에
와줘서 고마워. 오늘은 우리가 이 이야기를 듣고 난 후에 이 이야기의
주인공이 되어보는 동극활동을 할 거니까 귀를 쫑긋하고 들어보자.`,
      },
      {
        subtitle: '<거미가 줄을 타고 올라갑니다> 동화를 듣는다. ',
        content: `오늘은 거미 집에서 작은 파티가 있었어요.\n- 거미와 친구들은 즐거웠어요.\n- 이제 헤어질 시간이에요.\n- 거미: 잘 가!\n- 강아지: 거미야, 잘 있어. 음식이 정말 맛있었어. 너무 많이 먹었는걸\n- 강아지가 인사를 했어요.\n- 고양이: 거미야, 잘 있어. 난 너의 바느질 솜씨를 구경하느라 시간이\n어떻게 갔는지 모르겠어.\n- 고양이도 인사를 하고,\n- 사자: 거미야, 잘 있어. 난 너의 피아노 연주가 너무 좋았지.\n- 사자도 인사를 했어요.\n- 거미와 친구들이 헤어지려는 순간, 갑자기 강아지에게 생각난 것이\n있었어요.\n- 강아지: 아이고, 거미가 준 선물을 두고 왔네!\n- 그런데... 거미네 집은 아주 높은 곳에 있었어요.\n- 거미: 괜찮아, 내가 가지고 올게. 난 거미잖아.\n- 그래서 거미가 줄을 타고 올라갑니다.\n- 강아지에게 줄 초코 케이크를 가지고 거미가 줄을 타고 내려옵니다.\n- 고양이가 말했어요.\n- 고양이; 나도 거미가 준 선물을 두고 왔네.\n- 거미: 괜찮아, 내가 가지고 올게. 난 거미잖아.\n- 그래서 거미가 줄을 타고 올라갑니다.\n- 고양이에게 줄 이불을 가지고\n- 거미가 줄을 타고 내려옵니다.\n- 사자가 말했어요.\n- 사자: 어머, 나도 선물을 두고 왔어. 거미야 너무 힘들지?\n- 거미: 괜찮아, 내가 가지고 올게. 난 거미잖아.\n- 그래서 거미가 줄을 타고 올라갑니다.\n- 사자에게 줄 피아노를 가지고\n- 거미가 줄을 타고 내려옵니다.\n- 거미: 휴\n- 강아지: 거미야, 너무 고마워.\n- 고양이: 거미야, 너무 고마워.\n- 사자: 거미야, 너무 고마워.\n- 친구들은 고마운 거미를 위해 다시 작은 파티를 열었답니다.`,
      },
      {
        subtitle:
          '동화의 내용을 회상하며 동극으로 표현할 수 있는 방법에 대해 이야기를 나눈다',
        content: `이야기에 어떤 친구들이 나왔어?\n- 거미랑 사자, 강아지, 고양이까지 나왔지.\n- 처음에 강아지가 어떤 물건을 두고 나왔을까?\n- 다음에는 또 어떤 동물 친구가 물건을 두고 나왔지?\n- 친구들을 위해 물건을 가져다주는 거미의 마음이 어떤 것 같아?\n- 우리 달님반 친구들도 거미처럼 친구가 곤란해할 때 언제든지 도와줄\n수 있는 달님반이 되어줄 수 있겠니?\n- 이 이야기에서 거미가 어떻게 움직였지?\n- 거미는 무엇을 타고 이동했니?\n- 우리도 거미처럼 움직일 수 있을까?\n- 그것도 좋은 생각이다. 또 선생님 생각에는 이 실을 이용하면 마치 거미줄을 타고 움직이는 거미처럼 보일 수 있을 것 같아.`,
      },
      {
        subtitle: '배역을 나눈다.',
        content: `자 그럼 이제 역할을 정해보자.\n- 제일 먼저 고양이를 하고 싶은 어린이가 있니?\n- 다음으로 강아지를 하고 싶은 어린이가 있니?\n- 사자를 하고 싶은 어린이가 있니?\n- 사자를 하고 싶어하는 친구가 둘이나 있구나. 그럼 00이가 형님 사자를\n하고 00이가 아우 사자를 하는 것은 어때?\n- 거미를 하고 싶은 어린이가 있니?\n- 아무 역할도 정해지지 않았는데 동극을 꼭 하고 싶은 친구가 있을까?\n- 00이는 하고 싶은 역할이 없니?\n- 마음에 드는 역할이 없으면 거미의 집을 하는 건 어때?\n- 거미의 집은 친구들의 선물을 잘 가지고 있거나 거미줄이 끊어지지\n않도록 도와주는 꼭 필요한 역할이야. 00이가 해줄 수 있겠어?`,
      },
      {
        subtitle: '무대를 구성한다.',
        content: `이번에는 무대를 꾸며보자.\n- 어디를 거미의 집으로 하는 것이 좋을까?\n- 00이 말처럼 우리가 지난 시간에 환경 구성하면서 만든 거미줄이 있는\n피아노 앞을 거미의 집이라고 할까?\n- 거미의 집 밖은 어디로 하는 것이 좋을까?\n- 그럼 피아노와 칠판을 이 실로 이어볼게. 그럼 거미가 집이랑 밖을\n자유롭게 왔다갔다 할 수 있을거야.\n- 우리 거미가 줄을 타고 올라가고 내려가고 할 때 거미한테 어떠한 응원\n을 해줄 수 있을까?\n- 00이 말처럼 박수쳐주거나 선생님 생각에는 “거미가 줄을 타고 올라갑\n니다~”노래를 같이 불러도 큰 힘이 될 것 같아.`,
      },
      {
        subtitle: '동극 활동을 할 때 지켜야 할 약속을 만든다. ',
        content: `동극을 할 때 우리가 지켜야 할 약속에는 어떤 것들이 있을까?\n- 우리 친구들이 말해준 것처럼 친구들의 동극을 잘 보기, 큰 소리 내지\n않기, 친구들 방해하지 않기 등의 약속을 잘 지키면서 동극을 보자.\n- 그럼 관람하는 어린이들은 모두 한 칸씩 뒤로 가서 반원 모양으로 앉아\n볼까?`,
      },
      {
        subtitle: '동극을 한다. ',
        content: `자 그럼 지금부터 달님반의 동극 ‘거미가 줄을 타고 올라갑니다.’를\n시작하겠습니다! 오늘은 거미의 집에서 파티가 있는 날이었어요. (동극 생략)\n- 친구들은 고마운 거미를 위해 다시 조그만 파티를 열었답니다.\n- 이것으로 ‘거미가 줄을 타고 올라갑니다’ 동극을 모두 마치겠습니다.\n- 이제 연기를 한 어린이는 맡은 역할과 이름을 소개하자.\n- 열심히 멋진 동극을 보여준 친구들에게 박수를 쳐주자.\n- 우리 동극을 멋지게 봐준 친구들에게도 박수를 서로 쳐주자.\n- 착용했던 머리띠와 소품들은 모두 여기 바구니에 넣고 돌아가서 자리에 앉자.`,
      },
      {
        subtitle: '동극을 평가한다.',
        content: `오늘 <거미가 줄을 타고 올라갑니다>로 동극을 해봤는데 어땠어?\n- 무엇이 가장 재미있었니?\n- 거미의 친구들이 자꾸 물건을 까먹는게 재밌었구나.\n- 또 00이는 거미를 응원할 수 있어서 좋았구나.\n- 혹시 어려웠거나 아쉬웠던 부분이 있는 친구가 있니?\n- 거미줄이 하나밖에 없어서 집이랑 밖에만 왔다갔다하는 것이 재미가\n없었구나. 그럼 다음 번에는 어떻게 하면 좋을까?\n- 실 거미줄을 여러 곳에 이으면 거미가 여러 곳을 돌아다닐 수 있겠다.\n- 그럼 다음 신체 활동 때는 우리가 거미가 되어서 거미줄을 타보자.`,
      },
      {
        subtitle: '활동을 마무리하며 다음 활동을 안내한다.',
        content: `동극에 썼던 이 머리띠와 소품은 어디에 두면 될까?\n- 그럼 선생님이 머리띠랑 소품들을 역할 영역에 둘 테니까 동극을 하고 싶은 어린이들은 언제든지 와서 다시 해보자.\n- 다음은 간식 시간이구나. 오늘은 파란색 옷을 입은 친구들 먼저 일어나서 줄을 서보자.`,
      },
    ],
    precautions: [
      '동극 활동 중 유아들이 충분히 참여할 수 있도록 배역 분담에 신경쓴다.',
      '거미줄 역할극을 할 때 줄을 타고 이동하는 활동에서 안전을 최우선으로 하며, 유아가 줄에 걸려 넘어지지 않도록 주의를 준다.',
      '유아들이 동극을 연기할 때 서로의 역할을 존중하고 배려할 수 있도록 지도한다.',
    ],
    evaluation_criteria: [
      '유아가 활동에 적극적으로 참여하며 역할을 수행했는가?',
      '동극을 통해 주제와 관련된 내용을 잘 이해하고 표현했는가?',
      '거미와 관련된 동물 및 자연에 대한 관심을 가지며, 질문을 통해 호기심을 표현했는가?',
    ],
  },
  activity_record: {
    image: ['image_string_1', 'image_string_2'],
    subject: '수업기록의 주제입니다.',
    type: '수업기록의 활동유형입니다.',
    memo: '메모입니당.',
    file: [
      {
        url: 'https://example.com/path/to/file',
        type: 'application/pdf',
      },
    ],
  },
};
